IDENTIFICATION DIVISION.
   PROGRAM-ID. MOD.

DATA DIVISION.
   WORKING-STORAGE SECTION.
      01 WS-A PIC 9(18).
      01 WS-B PIC 9(18).
      01 WS-C PIC 9(18).
      01 WS-RES PIC 9(18).
      01 WS-R PIC 9(19).

PROCEDURE DIVISION.
   DISPLAY 'Enter A: '.
   ACCEPT WS-A.
   DISPLAY 'Enter B: '.
   ACCEPT WS-B.
   DISPLAY 'Enter C: '.
   ACCEPT WS-C.

   MULTIPLY WS-A BY WS-B,
   DISPLAY WS-B.
   DIVIDE WS-B BY WS-C GIVING WS-RES REMAINDER WS-R.
   DISPLAY WS-R.
   STOP RUN.
