IDENTIFICATION DIVISION.
    PROGRAM-ID. PRIME1.

DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WS-NUM PIC 9(3).
        01 WS-RES PIC 9(1).
        01 WS-TOTAL PIC 9(18) VALUE 0.

PROCEDURE DIVISION.
    PERFORM VARYING WS-NUM FROM 101 BY 2 UNTIL WS-NUM > 200
        CALL 'IS-PRIME' USING WS-NUM, WS-RES
        IF WS-RES = 1 THEN
            ADD WS-NUM TO WS-TOTAL
        END-IF
    END-PERFORM.
    DISPLAY WS-TOTAL.

STOP RUN.
