IDENTIFICATION DIVISION.
    PROGRAM-ID. FACTOR.

DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WS-NUM PIC 9(3).
        01 WS-RES PIC 9(1).

PROCEDURE DIVISION.
    PERFORM VARYING WS-NUM FROM 3 BY 2 UNTIL WS-NUM > 100
        CALL 'IS-PRIME' USING WS-NUM, WS-RES
        IF WS-RES = 1 THEN
            DISPLAY WS-NUM
        END-IF
    END-PERFORM.
    DISPLAY 'DONE'.

STOP RUN.
