IDENTIFICATION DIVISION.
   PROGRAM-ID. ATBASH.

DATA DIVISION.
   WORKING-STORAGE SECTION.
      01 WS-IN PIC A(64).
      01 WS-OUTPUT PIC A(32).
      01 WS-ALPHA PIC A(26) VALUE 'ZYXWVUTSRQPONMLKJIHGFEDCBA'.
      01 WS-IDX PIC 9(2).
      01 WS-T1 PIC X(1).
      01 WS-T2 REDEFINES WS-T1 PIC 9(2) COMP-X.
      01 WS-RES PIC A(1).

PROCEDURE DIVISION.
   DISPLAY 'INPUT: '.
   ACCEPT WS-IN.
   PERFORM VARYING WS-IDX FROM 1 BY 1 UNTIL WS-IDX > FUNCTION LENGTH(WS-IN)
       MOVE WS-IN(WS-IDX:1) TO WS-T1
       IF WS-T2 < 65 OR WS-T2 > 90 THEN
           MOVE WS-T1 TO WS-RES
       ELSE
          SUBTRACT 64 FROM WS-T2
          MOVE WS-ALPHA(WS-T2:1) TO WS-RES
       END-IF
       STRING WS-OUTPUT(1:WS-IDX) DELIMITED BY SIZE
          WS-RES DELIMITED BY SIZE
          INTO WS-OUTPUT
       END-STRING
    END-PERFORM.
    DISPLAY WS-OUTPUT.
STOP RUN.
