IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOP.

       DATA DIVISION.
           WORKING-STORAGE SECTION.
	   01 NUM PIC 9(3) VALUE 2.
	   01 FIB1 PIC 9(32) VALUE 0.
	   01 FIB2 PIC 9(32) VALUE 1.
	   01 FIBN PIC 9(32) VALUE 1.


       PROCEDURE DIVISION.
           A-PARA.
           PERFORM B-PARA WITH TEST AFTER UNTIL NUM>100.
           STOP RUN.

	   B-PARA.
	   DISPLAY 'F('NUM') = 'FIBN
	   ADD FIB1 TO FIB2 GIVING FIBN
	   SET FIB1 TO FIB2
	   SET FIB2 TO FIBN
	   ADD 1 TO NUM.
