IDENTIFICATION DIVISION.
   PROGRAM-ID. CONVERT.

DATA DIVISION.
   WORKING-STORAGE SECTION.
      01 WS-IN PIC A(64).
      01 WS-OUTPUT PIC A(32).
      01 WS-LETTER PIC A(1).
      01 WS-IDX PIC 9(2).

PROCEDURE DIVISION.
   DISPLAY 'INPUT: '.
   ACCEPT WS-IN.
   PERFORM VARYING WS-IDX FROM 1 BY 2 UNTIL WS-IDX > FUNCTION LENGTH(WS-IN)
      CALL 'TOLETTER' USING WS-IN(WS-IDX:2), WS-LETTER
      STRING WS-OUTPUT DELIMITED BY SPACE
         WS-LETTER DELIMITED BY SIZE
         INTO WS-OUTPUT
      END-STRING
   END-PERFORM.
   DISPLAY WS-OUTPUT.
STOP RUN.
