IDENTIFICATION DIVISION.
   PROGRAM-ID. TOASCII.

DATA DIVISION.
   WORKING-STORAGE SECTION.
      01 WS-ALPHA PIC A(26) VALUE 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'.
      01 WS-START PIC 9(2) VALUE 64.
      01 WS-IDX PIC 9(2) VALUE 0.
   LINKAGE SECTION.
      01 LS-LETTER PIC A(1).
      01 LS-CODE PIC 9(2).

PROCEDURE DIVISION USING LS-LETTER, LS-CODE.
    PERFORM VARYING WS-IDX FROM 1 BY 1 UNTIL WS-IDX > FUNCTION LENGTH(WS-ALPHA)
        IF LS-LETTER = WS-ALPHA(WS-IDX:1) THEN
            ADD WS-IDX TO WS-START GIVING LS-CODE
            GOBACK
        END-IF
    END-PERFORM.
EXIT PROGRAM.
