IDENTIFICATION DIVISION.
   PROGRAM-ID. TOLETTER.

DATA DIVISION.
   WORKING-STORAGE SECTION.
      01 WS-ALPHA PIC A(26) VALUE 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'.
      01 WS-START PIC 9(2) VALUE 64.
   LINKAGE SECTION.
      01 LS-LETTER PIC A(1).
      01 LS-CODE PIC 9(2).

PROCEDURE DIVISION USING LS-CODE, LS-LETTER.
   SUBTRACT WS-START FROM LS-CODE.
   MOVE WS-ALPHA(LS-CODE:1) TO LS-LETTER.
EXIT PROGRAM.
