IDENTIFICATION DIVISION.
   PROGRAM-ID. CEASARR.

DATA DIVISION.
   WORKING-STORAGE SECTION.
      01 WS-IN PIC A(64).
      01 WS-OUTPUT PIC A(32).
      01 WS-SHIFT PIC 9(2).
      01 WS-IDX PIC 9(2).
      01 WS-T1 PIC X(1).
      01 WS-T2 REDEFINES WS-T1 PIC 9(2) COMP-X.
      01 WS-DISCARD PIC 9(2).

PROCEDURE DIVISION.
   DISPLAY 'INPUT: '.
   ACCEPT WS-IN.
   PERFORM VARYING WS-SHIFT FROM 0 BY 1 UNTIL WS-SHIFT > 25
       PERFORM VARYING WS-IDX FROM 1 BY 1 UNTIL WS-IDX > FUNCTION LENGTH(WS-IN)
          IF WS-IN(WS-IDX:1) NOT = ' ' THEN
             MOVE WS-IN(WS-IDX:1) TO WS-T1
             SUBTRACT 65 FROM WS-T2
             ADD WS-SHIFT TO WS-T2
             DIVIDE WS-T2 BY 26 GIVING WS-DISCARD REMAINDER WS-T2
             ADD 65 TO WS-T2
             STRING WS-OUTPUT(1:WS-IDX) DELIMITED BY SIZE
                WS-T1 DELIMITED BY SPACE
                INTO WS-OUTPUT
             END-STRING
         END-IF
       END-PERFORM
       DISPLAY WS-SHIFT' 'WS-OUTPUT
       MOVE ' ' TO WS-OUTPUT
   END-PERFORM.
STOP RUN.
